export const modeList: Mode[] = [
    {
        name: "aram",
        code: 450,
        wikiName: "ARAM"
    },
    {
        name: "urf",
        code: 900,
        wikiName: "Ultra_Rapid_Fire"
    },
    {
        name: "ultbook",
        code: 1400,
        wikiName: "Ultimate_Spellbook"
    },
    {
        name: "oneforall",
        code: 1020,
        wikiName: "One_for_All"
    },
    {
        name: "nexus",
        code: 1300,
        wikiName: "Nexus_Blitz"
    }
]

export const modeOtherChange: ModeOtherChange = {
    aram: {
        Akshan: ["W技能赴险夺人，恶人标记的持续时间减少到 25 秒"],
        Azir: ["W技能沙兵现身，开局自动消耗一点技能点升级"],
        Bard: ["被动技能旅者的召唤，木灵的CD时间从 50 秒减少到 40 秒"],
        BelVeth: ["被动技能溶烛化紫，附近死亡的攻城小兵将使其获得 2 层被动", "R技能万载豪筵，附近被摧毁的防御塔将会召唤虚空鱼"],
        Corki: ["被动技能海克斯科技军备，弹药包将会在 5:00 时生成，CD时间减少到 150 秒"],
        Gangplank: ["Q技能枪火谈判，新增被动效果：每秒自动获得 1 枚银蛇币"],
        Garen: ["W技能勇气，击杀时的额外抗性增加到 0.5，达到最大额外抗性所需的敌人击杀数减少到 60"],
        Nasus: ["Q技能汲魂痛击，击杀普通单位增加到 6 层，击杀大型单位增加到 24 层"],
        Ornn: ["被动技能活体锻炉，将会有 120 秒的CD时间"],
        Qiyana: ["W技能方圆塑令，以治疗祭坛为目标施放可以获得河流元素"],
        Shyvana: ["被动技能龙族之怒，完全更改：在 1400 码范围内，每当有一个攻城小兵、超级兵死亡或希瓦娜被敌方的治疗祭坛治疗时，希瓦娜获得 1 点额外护甲、1 点额外魔抗和 0.05 点怒气回复加成（死亡时无效）"],
        Skarner: ["被动技能水晶尖塔，地图上生成的水晶尖塔数量更改为 5 个"],
        Thresh: ["被动技能地狱诅咒，每个灵魂将算作 2 层"],
        Yorick: ["被动技能牧魂人，坟墓所需的死亡敌人数改为全等级 5 个"]
    },
    nexus: {
        Bard: ["被动技能旅者的召唤，提高了调和之音出现的概率"],
        Ivern: ["被动技能森林之友，此模式下禁用"],
        Kindred: ["被动技能千珏之印，野区不再出现印记，英雄的印记效果上升为 2 层，击杀蓝Buff、红Buff以及峡谷先锋时获得 1 层印记"],
        Mordekaiser: ["R技能轮回绝境，某些事件下，死者领域将会立即结束"],
        Nasus: ["Q技能汲魂痛击，击杀普通单位增加到 6 层，击杀大型单位增加到 24 层"],
        Sett: ["R技能叹为观止，对河道蟹、战利品提莫、战利品维嘉或者练习家人释放时，额外生命值的加成将会基于拥有最大额外生命值的敌方英雄计算"],
        Shyvana: ["被动技能龙族之怒，完全更改：每当她或她的队友杀死野怪或者河道蟹时，希瓦娜获得 2 点额外护甲和额外魔抗，0.05 点怒气回复加成"],
        Sion: ["W技能灵魂熔炉，击杀单位获得的额外生命值翻倍，助攻获得的不变"],
        Talon: ["R技能暗影突袭，CD时间改为 80/67.5/55/42.5/30 秒"],
        Veigar: ["被动技能超凡邪力，击杀单位获得的法强翻倍，助攻获得的不变"]
    },
    oneforall: {
        Aphelios: ["Q技能武器技能，主动释放将会引爆所有敌人身上的坠明效果"],
        Azir: ["移速增加 5%"],
        Draven: ["Q技能旋转飞斧，可以被队友德莱文捡起（偷走），同时还会触发独特的语音"],
        Ekko: ["W技能时光交错，可以与所有队友产生效果"],
        FiddleSticks: ["Q技能恐惧，恐惧效果将会与所有队友共享"],
        Fiora: ["R技能无双挑战，无法对已经被释放此技能的敌人释放"],
        Malphite: ["E技能大地震颤，减攻速效果可以叠加"],
        Quinn: ["被动技能侵扰，只有自己的易损目标才能触发额外伤害，但是敌人可以存在多个易损状态", "W技能敏锐感知，所有队友的易损目标都可以触发增加攻速和移速的被动效果"],
        Senna: ["被动技能赦除，每个赛娜的被动将会是独立存在，灵魂不共享"],
        Singed: ["Q技能剧毒踪迹，可以叠加"],
        Syndra: ["R技能能量倾泻，可以使用队友的暗黑发球，最多 7 颗"],
        Thresh: ["移速增加 5%"],
        Trundle: ["R技能强权至上，可以叠加"],
        Zed: ["R技能禁奥义！瞬狱影杀阵，每个敌人只能被标记一次，对一个已经拥有标记的敌人释放，将会去除原先所有的标记，防止被消除标记的伤害和爆炸效果，每个标记将会将所有劫造成的伤害都计算在内"],
        Zilean: ["E技能时光发条，可以叠加"]
    },
    urf: {
        Alistar: ["W技能野蛮冲撞，只要目标移动完，眩晕就会结束", "R技能坚定意志，持续时间减少到3.5秒"],
        Anivia: ["被动技能寒霜涅槃，CD时间减少到 60 秒"],
        AurelionSol: ["被动技能星原之准，围绕的行星数增加到 3/4/5/6（基于等级）"],
        Azir: ["W技能沙兵现身，最多拥有三名沙兵，沙兵充能时间设置为 4.8/4.4/4/3.6/3.2 秒"],
        Bard: ["被动技能旅者的召唤，木灵的强化攻击所需的调和之音数从 5 个降到 2 个，木灵的生成时间减少到 6 秒"],
        Brand: ["Q技能火焰烙印，眩晕时间减少到 1 秒"],
        Corki: ["被动技能海克斯科技军备，CD时间减少到 60 秒"],
        Evelynn: ["基础移速从335增加到345", "Q技能憎恨之刺，可以再次释放的次数增加到 10 次"],
        Ezreal: ["Q技能秘术射击，对于 W/E/R 的减CD效果从 1.5 秒减少到 0.3333 秒"],
        Fiora: ["成长生命值从 85 减少到 60"],
        Gangplank: ["Q技能枪火谈判，获得的银蛇币变成 3 倍", "E技能火药桶，火药桶的生命值衰减时间将在 19 级和 25 级时分为减少到 0.264 秒和 0.132 秒"],
        Garen: ["E技能审判，不可以叠加释放"],
        Gragas: ["E技能肉弹冲击，命中敌人之后的减CD效果从 3 秒减少到 1 秒"],
        Hecarim: ["Q技能暴走，移除了叠加之后的减CD效果", "E技能毁灭冲锋，CD时间将在释放完成之后才开始计算"],
        Jax: ["基础生命值从 592 降低到 550", "成长生命值从 85 降低到 60"],
        Karma: ["被动技能聚能之炎，减CD的效果减少到 0.5/0.75/1 秒"],
        Karthus: ["基础生命值从 528 降低到 450", "成长生命值从 87 降低到 65"],
        Kassadin: ["R技能虚空行走，冷却时间设置为 3/2/1 秒，最大叠加 2 层"],
        Kindred: ["Q技能乱箭之舞，在W技能狼灵狂热效果的领地之内时，CD时间设置为 0.5 秒"],
        Maokai: ["E技能树苗投掷，最多拥有 5 个树苗"],
        MasterYi: ["Q技能阿尔法突袭，CD时间将在释放完成之后才开始计算"],
        Nunu: ["E技能雪球飞射，可以重复释放 10 次"],
        Ornn: ["基础移速从 335 增加到 340", "基础生命值从 565 增加到 600", "成长生命值从 95 增加到 105"],
        Rumble: ["基础生命值从 589 降低到 550", "成长生命值从 85 降低到 65", "被动技能机械重组，红温时不再沉默自身，黄温时不再增强基础技能"],
        Shaco: ["W技能惊吓魔盒，最多拥有 6 个魔盒"],
        Skarner: ["Q技能水晶横扫，移除减CD效果"],
        Sona: ["基础生命值从 480 降低到 463", "成长生命值从 77 降低到 50", "被动技能能量和弦，减CD效果设置为 0.5 秒"],
        TahmKench: ["基础移速从 335 增加到 340", "成长生命值从 100 增加到 120", "Q技能巨舌鞭笞，CD时间增加 100%"],
        Teemo: ["R技能种蘑菇，最多拥有 12 个蘑菇"],
        Thresh: ["被动技能地狱诅咒，每个灵魂将算作 3 层"],
        Yuumi: ["E技能旺盛精力，CD时间增加 100%"],
        Zac: ["成长生命值从 95 增加到 105", "基础护甲从 33 增加到 38", "成长护甲从 3.5 增加到 4.5", "成长魔抗从 1.25 增加到 1.75"],
        Zed: ["基础生命值从 582 降低到 550", "成长生命值从 85 降低到 60"],
        Zilean: ["Q技能定时炸弹，眩晕时间全等级减少 0.6 秒，CD时间增加 80%", "W技能穿梭未来，CD时间增加 100%"]
    },
    ultbook: {
        Bard: ["被动技能旅者的召唤，获得 5% 的额外移速"],
        Thresh: ["被动技能地狱诅咒，获得 5% 的额外移速"]
    }
}

export const message = {
    id: 2022080218,
    title: "通知",
    content: "1. 底层代码全部使用 TypeScript 重构\n2. 更改云服务商，更快更流畅",
    available: true
}